In [1]:
import pandas as pd

In [2]:
data=pd.read_csv("Data.csv")
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [6]:
from io import StringIO
import pandas as pd  # Added import for pandas

csv_data=\
'''A,B,C,D
1.0,2.0,3.0,4.0
5.0,6.9,,8.0
10.0,11.0,12.0'''  # Removed trailing commas from lines 3 and 4

df=pd.read_csv(StringIO(csv_data))
df

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.9   NaN  8.0
2  10.0  11.0  12.0  NaN

In [7]:
data.isnull().sum()

Country      0
Age          1
Salary       1
Purchased    0
dtype: int64

In [9]:
df.values

array([[ 1. ,  2. ,  3. ,  4. ],
       [ 5. ,  6.9,  nan,  8. ],
       [10. , 11. , 12. ,  nan]])

In [10]:
data.values

array([['France', 44.0, 72000.0, 'No'],
       ['Spain', 27.0, 48000.0, 'Yes'],
       ['Germany', 30.0, 54000.0, 'No'],
       ['Spain', 38.0, 61000.0, 'No'],
       ['Germany', 40.0, nan, 'Yes'],
       ['France', 35.0, 58000.0, 'Yes'],
       ['Spain', nan, 52000.0, 'No'],
       ['France', 48.0, 79000.0, 'Yes'],
       ['Germany', 50.0, 83000.0, 'No'],
       ['France', 37.0, 67000.0, 'Yes']], dtype=object)

In [13]:
#dropping the rows containing missing or Nan values in data dataset using dropna

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [17]:
df.dropna(axis=0)

     A    B    C    D
0  1.0  2.0  3.0  4.0

In [18]:
df.dropna(axis=1)

      A     B
0   1.0   2.0
1   5.0   6.9
2  10.0  11.0

In [ ]:
!git add Data_preprocessing.ipynb
!git commit -m "Data Preprocessing"
!git push